<?php

return [
    'heading_title'             => 'Створити новий розрахунок витрат',

    'text_date_range'           => 'Діапазон дат (розділюйте за допомогою "-")',
    'text_date_range_help'      => 'Діапазон дат з якого буде розраховуватись період витрат (місяць), вкажіть лише дні!',
    'text_income_funds'         => 'З/п',
    'text_save'                 => 'Зберегти',
    'text_add_costs_btn'        => 'Додати витрати',
    'text_cost_name'            => 'Назва витрати',
    'text_cost_total'           => 'Сума витрати',
    'text_add_dreams_btn'       => 'Додати мрію',
    'text_dream_name'           => 'Назва мрії',
    'text_dream_total'          => 'Сума мрії',

    'error_date_range'          => 'Діапазон дат обов\'язковий!',
    'error_income_funds'        => 'З/п обов\'язкова!',
    'error_cost_name'           => 'Назва витрати обов\'язкова!',
    'error_cost_total'          => 'Сума витрати обов\'язкова!',
    'error_dream_name'          => 'Назва мрії обов\'язкова!',
    'error_dream_total'         => 'Сума мрії обов\'язкова!',
    'error_cost_array'          => 'Якщо Ви вирішили додати витрати, то обов\'язково потрібно вказати назву та суму витрати!',
    'error_cost_some_name'      => 'Десь завтикали вказати назву витрати!',
    'error_cost_some_total'     => 'Десь завтикали вказати суму витрати!',
    'error_dream_array'         => 'Якщо Ви вирішили додати витрати на мрію, то обов\'язково потрібно вказати назву та суму витрати на мрію!',
    'error_dream_some_name'     => 'Десь завтикали вказати назву витрати на мрію!',
    'error_dream_some_total'    => 'Десь завтикали вказати суму витрати на мрію!',
];
